class AgileCard:
    @staticmethod
    def start() -> list[str]:
        posts = [
            '<b>Интро</b>\n\nЗнакомьтесь — в этой карточке вам предстоит пройти непростой путь с героиней по имени '
            '<i>Фимврис</i>.\n<i>Фимврис</i> работает в крупной продакшн-компании, которая запускает разные '
            'просветительские и образовательные продукты. Недавно <i>Фимврис</i> залидила курс по модному Agile-у. '
            'Цель — погрузить студентов в основные принципы и процессы этого модного фреймворка и научить их следовать '
            'им.\n\nЭто предзаписанные видео и задания в формате симуляторов без поддержки со стороны экспертов. '
            '80% курса уже готова и выложена на платформу. Огненные эксперты-спикеры из международных компаний, '
            'идеально сверстанные презентации, интересные симуляторы — всё идет замечательно!\n\nНо в один день '
            '<i>Фимврис</i> получает неприятное сообщение отруководителя. И... попадает в петлю улучшения. '
            'Закроют ли продукт или проблема подтолкнет её статькрутым профессионалом?\n\nВам предстоит прожить '
            'этот день вместе с <i>Фимврис</i>. Снова и снова.',
            '🏷️ <b>Петля 1 — Ошибка гипотезы</b> 🏷️',
            '👨‍💼 <b>Олег, руководитель продакшн-отдела, ⏱️ 7:33</b>\n\n'
            '<i>Фимврис</i>, вставай! Звонил наш самый крупный '
            'клиент, он просто в ярости. Сотрудники не проходят курс по Agile-у. Мало кто даже до второго модуля '
            'доходит. Говорит, он уже второе письмо о важности этого курса отправлял, ничего не работает. Ему нужно до '
            'конца месяца, чтобы все перешли на Agile, иначе сверху бошку открутят.  В общем, он требует 100% '
            'возврата, чтобы срочно найти другой курс.\n\nДоговорились, что мы до конца дня решим проблему с '
            'доходимостью. Еле-еле выбил это время...\n\nВ общем, делай что хочешь, но нельзя подвести клиента. У нас '
            'с ним на подходе еще два крупных контракта.',
            '👩🏻‍💼 <b>Фимврис, ⏱️ 7:40</b>\n\n'
            'Что произошло? Почему его сотрудники не проходят курс?',
            '👨‍💼 <b>Олег, руководитель продакшн-отдела, ⏱️ 7:42</b>\n\n'
            'Алё, это большая шишка, он такими вопросами не занимается. Твой продукт — ты и узнавай.',
            '👩🏻‍💼 <i>Размышления Фиврис:\nТак, Фимврис, думай, в чем может быть дело? Надо сгенерировать гипотез, '
            'как говорит Олег.</i> '
        ]

        return posts

    @staticmethod
    def generate_hypothesis(self):
        pass
